Revit 2024 API
WallPaint.WallpaintApplication Property
 The property labeled "Application" from the "WallPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string WallpaintApplication { get; }
Visual Basic
Public Shared ReadOnly Property WallpaintApplication As String
	Get
Visual C++
public:
static property String^ WallpaintApplication {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WallpaintApplicationType".
See Also
WallPaint Class
Autodesk.Revit.DB.Visual Namespace